In [21]:
import pyodbc
import pandas as pd

csv_file_path = "D:\\MLChecked\\VS Code\\Book_Recommendation\\Sql_csv\\order_history.csv"  
data = pd.read_csv(csv_file_path)

# Function to map pandas data types to SQL Server data types
def get_sql_type(dtype):
    if pd.api.types.is_integer_dtype(dtype):
        return 'INT'
    elif pd.api.types.is_float_dtype(dtype):
        return 'FLOAT'
    elif pd.api.types.is_string_dtype(dtype):
        return 'VARCHAR(255)'
    elif pd.api.types.is_datetime64_dtype(dtype):
        return 'DATETIME'
    else:
        return 'VARCHAR(255)'  # Default to VARCHAR if type is unrecognized

# Connect to SQL Server
conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER=SGI_TESTINGDB\\SQL2017;DATABASE=NOVA_2017;UID=sa;PWD=sgi@123?')
cursor = conn.cursor()

# Define the table name
table_name = 'bookorder_history'

# Check if the table exists and create it if necessary
cursor.execute(f"""
    IF NOT EXISTS (SELECT * FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_NAME = '{table_name}')
    BEGIN
        CREATE TABLE {table_name} (
            {', '.join([f"[{col}] {get_sql_type(dtype)}" for col, dtype in zip(data.columns, data.dtypes)])}
        )
    END
""")
conn.commit()

# Dynamically get column names from DataFrame, enclosing them in square brackets to avoid syntax issues
columns = ', '.join([f"[{col}]" for col in data.columns])
placeholders = ', '.join(['?' for _ in data.columns])

# SQL query template for inserting data
sql = f"INSERT INTO {table_name} ({columns}) VALUES ({placeholders})"

# Loop through DataFrame rows and insert data
for index, row in data.iterrows():
    values = tuple(row)  # Convert row to tuple for parameterized query
    try:
        # Execute the SQL query
        cursor.execute(sql, values)
    except Exception as e:
        print(f"Error inserting row {index}: {e}")

# Commit transaction
conn.commit()

# Close the cursor and connection
cursor.close()
conn.close()

print(f"Data inserted successfully into {table_name}")

Data inserted successfully into bookorder_history

In [ ]:
import pyodbc
import pandas as pd

csv_file_path = "D:\\MLChecked\\VS Code\\Book_Recommendation\\Sql_csv\\order_history.csv"  
data = pd.read_csv(csv_file_path)

# Connect to SQL Server
conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER=SGI_TESTINGDB\\SQL2017;DATABASE=NOVA_2017;UID=sa;PWD=sgi@123?')
cursor = conn.cursor()

# Define the table name
table_name = 'order_history'

# Dynamically get column names from DataFrame, enclosing them in square brackets to avoid syntax issues
columns = ', '.join([f"[{col}]" for col in data.columns])
placeholders = ', '.join(['?' for _ in data.columns])

# SQL query template for inserting data
sql = f"INSERT INTO {table_name} ({columns}) VALUES ({placeholders})"

# Loop through DataFrame rows and insert data
for index, row in data.iterrows():
    values = tuple(row)  # Convert row to tuple for parameterized query
    try:
        # Execute the SQL query
        cursor.execute(sql, values)
    except Exception as e:
        print(f"Error inserting row {index}: {e}")

# Commit transaction
conn.commit()

# Close the cursor and connection
cursor.close()
conn.close()

print(f"Data inserted successfully into {table_name}")

# ** Filtered SQL data **

In [22]:
pip install pandas sqlite3

Requirement already satisfied: pandas in c:\users\c186\appdata\local\programs\python\python312\lib\site-packages (2.2.1)Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution ~treamlit (c:\Users\c186\AppData\Local\Programs\Python\Python312\Lib\site-packages)
ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)
ERROR: No matching distribution found for sqlite3

In [40]:
import pandas as pd
import pyodbc

# Connect to SQL Server
conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER=SGI_TESTINGDB\\SQL2017;DATABASE=NOVA_2017;UID=sa;PWD=sgi@123?')


# Write the SQL query to filter the data
query = """
SELECT 
    a.book_id, 
    a.title, 
    a.isbn13, 
    a.publication_date, 
    b.language_name,    
    c.publisher_name,   
    d.customer_id,
	d.first_name,
	d.last_name,
    e.order_id,    
	h.author_name
FROM 
    book a
JOIN 
    book_language b 
    ON a.language_id = b.language_id
JOIN 
    publisher c 
    ON a.publisher_id = c.publisher_id
JOIN 
    bookorder_line f
    ON a.book_id = f.book_id        
JOIN 
    cust_order e
    ON e.order_id = f.order_id      
JOIN 
    customer d 
    ON d.customer_id = e.customer_id
JOIN
	book_author g 
	on a.book_id = g.book_id
JOIN 
	author h
	on g.author_id = h.author_id
"""

# Execute the query and Convert to DataFrame
result = pd.read_sql_query(query, conn)
df = pd.DataFrame(result)
# Close the connection
conn.close()

df

C:\Users\c186\AppData\Local\Temp\ipykernel_13232\3633910331.py:48: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, conn)

,book_id,title,isbn13,publication_date,language_name,publisher_name,customer_id,first_name,last_name,order_id,author_name
0,3,The Servant Leader,23755004321,2003-03-11,English,Thomas Nelson,1023,Noell,Rapi,6428,Kenneth H. Blanchard
1,3,The Servant Leader,23755004321,2003-03-11,English,Thomas Nelson,312,Arda,Wanderschek,1294,Kenneth H. Blanchard
2,4,What Life Was Like in the Jewel in the Crown: ...,34406054602,1999-09-01,English,Time Life Medical,1508,Jeramie,McCrann,4555,Time-Life Books
3,5,Cliffs Notes on Aristophanes' Lysistrata The ...,49086007763,1983-12-29,English,Cliffs Notes,1710,Vergil,MacKay,7018,W. John Campbell
4,5,Cliffs Notes on Aristophanes' Lysistrata The ...,49086007763,1983-12-29,English,Cliffs Notes,63,Margette,Cawdell,6432,W. John Campbell
...,...,...,...,...,...,...,...,...,...,...,...
24526,11123,Asfixia,9789875661707,2006-09-01,English,Debolsillo,1017,Fern,O'Gavin,6642,Chuck Palahniuk
24527,11123,Asfixia,9789875661707,2006-09-01,English,Debolsillo,220,Worthington,Maxstead,1090,Chuck Palahniuk
24528,11125,Fantasmas,9789879397503,2006-08-28,Spanish,Mondadori,75,Enrichetta,Morrill,11420,Chuck Palahniuk
24529,11125,Fantasmas,9789879397503,2006-08-28,Spanish,Mondadori,75,Enrichetta,Morrill,11420,Javier Calvo
24530,11126,Stand by Me,9789998691568,1986-06-01,English,Columbia Pictures Pubns,1524,Adiana,Tipperton,1289,Raynold Gideon

In [ ]:
from sqlalchemy import create_engine
import pyodbc

# SQL Connection details
server = "SERVER=SGI_TESTINGDB\\SQL2017"
database = "NOVA_2017"
username = "sa"
password = "sgi@123?"

# Connection String
Connection_String = "mssql+pyodbc://{username}:{password}@{server}/{database}?driver=ODBC+Driver+17+for+SQL+Server"

engine = create_engine(Connection_String)

# SQL Query

query = "select * from book"

#Result and convert to Data Farme

result = pd.read_sql_query(engine,query)

df = pd.DataFrame(result)


#print datafreame

df.head()

In [41]:
df.to_csv("Final_data.csv", index=False)

# **Data** **Handling** **and** **Feature Engineering**

In [48]:
df.head()

,book_id,title,isbn13,publication_date,language_name,publisher_name,customer_id,first_name,last_name,order_id,author_name,published_year,published_month,published_day
0,3,The Servant Leader,23755004321,2003-03-11,English,Thomas Nelson,1023,Noell,Rapi,6428,Kenneth H. Blanchard,1,3,11
1,3,The Servant Leader,23755004321,2003-03-11,English,Thomas Nelson,312,Arda,Wanderschek,1294,Kenneth H. Blanchard,1,3,11
2,4,What Life Was Like in the Jewel in the Crown: ...,34406054602,1999-09-01,English,Time Life Medical,1508,Jeramie,McCrann,4555,Time-Life Books,2,9,1
3,5,Cliffs Notes on Aristophanes' Lysistrata The ...,49086007763,1983-12-29,English,Cliffs Notes,1710,Vergil,MacKay,7018,W. John Campbell,3,12,29
4,5,Cliffs Notes on Aristophanes' Lysistrata The ...,49086007763,1983-12-29,English,Cliffs Notes,63,Margette,Cawdell,6432,W. John Campbell,3,12,29

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24531 entries, 0 to 24530
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           24531 non-null  int64
 1   title             24531 non-null  object
 2   isbn13            24531 non-null  object
 3   publication_date  24531 non-null  object
 4   language_name     24531 non-null  object
 5   publisher_name    24531 non-null  object
 6   customer_id       24531 non-null  int64
 7   first_name        24531 non-null  object
 8   last_name         24531 non-null  object
 9   order_id          24531 non-null  int64
 10  author_name       24531 non-null  object
dtypes: int64(3), object(8)
memory usage: 2.1+ MB

In [44]:
df.isnull().sum()

book_id             0
title               0
isbn13              0
publication_date    0
language_name       0
publisher_name      0
customer_id         0
first_name          0
last_name           0
order_id            0
author_name         0
dtype: int64

In [ ]:
# convert date time formate
df["publication_date"] = pd.to_datetime(df["publication_date"])

In [49]:
df["published_day"] = df["publication_date"].dt.day
df["published_month"] = df["publication_date"].dt.month
df["published_year"] = df["publication_date"].dt.year
df["published_weekday"] = df["publication_date"].dt.weekday
df.head()

,book_id,title,isbn13,publication_date,language_name,publisher_name,customer_id,first_name,last_name,order_id,author_name,published_year,published_month,published_day,published_weekday
0,3,The Servant Leader,23755004321,2003-03-11,English,Thomas Nelson,1023,Noell,Rapi,6428,Kenneth H. Blanchard,2003,3,11,1
1,3,The Servant Leader,23755004321,2003-03-11,English,Thomas Nelson,312,Arda,Wanderschek,1294,Kenneth H. Blanchard,2003,3,11,1
2,4,What Life Was Like in the Jewel in the Crown: ...,34406054602,1999-09-01,English,Time Life Medical,1508,Jeramie,McCrann,4555,Time-Life Books,1999,9,1,2
3,5,Cliffs Notes on Aristophanes' Lysistrata The ...,49086007763,1983-12-29,English,Cliffs Notes,1710,Vergil,MacKay,7018,W. John Campbell,1983,12,29,3
4,5,Cliffs Notes on Aristophanes' Lysistrata The ...,49086007763,1983-12-29,English,Cliffs Notes,63,Margette,Cawdell,6432,W. John Campbell,1983,12,29,3

In [50]:
# drop publication_date Column
df.drop("publication_date",axis=1,inplace=True)

# **Google Request**

In [58]:
title = df["title"]
author = df["author_name"]

In [61]:
data = df[["title","author_name"]]
data

                                                   title           author_name
0                                     The Servant Leader  Kenneth H. Blanchard
1                                     The Servant Leader  Kenneth H. Blanchard
2      What Life Was Like in the Jewel in the Crown: ...       Time-Life Books
3      Cliffs Notes on Aristophanes' Lysistrata  The ...      W. John Campbell
4      Cliffs Notes on Aristophanes' Lysistrata  The ...      W. John Campbell
...                                                  ...                   ...
24526                                            Asfixia       Chuck Palahniuk
24527                                            Asfixia       Chuck Palahniuk
24528                                          Fantasmas       Chuck Palahniuk
24529                                          Fantasmas          Javier Calvo
24530                                        Stand by Me        Raynold Gideon

[24531 rows x 2 columns]

In [ ]:
import requests
import pandas as pd

# Function to get book data from Google Books API
def get_book_info(title, author, api_key):
    # Construct the query string
    query = f"intitle:{title}+inauthor:{author}"
    
    # Send request to Google Books API
    url = f"https://www.googleapis.com/books/v1/volumes?q={query}&key={api_key}"
    response = requests.get(url)
    
    # Check if the response is successful
    if response.status_code == 200:
        data = response.json()
        if "items" in data:
            # Extract relevant details from the response
            book_info = data["items"][0]["volumeInfo"]
            
            # Get genres (categories)
            genres = book_info.get("categories", ["Unknown"])
            
            # Get image URL (if available)
            image_url = book_info.get("imageLinks", {}).get("thumbnail", "No image available")
            
            return genres, image_url
        else:
            return ["No genre found"], "No image available"
    else:
        return ["Error with API request"], "No image available"

# Your dataset (example)
data = data

# Create a DataFrame from the dataset
df_genre = pd.DataFrame(data)

# Your Google Books API key
api_key = "AIzaSyB8IubhIwhGqcfq421oO3bNWiTABCpdo_M"

# Get genres and image URLs for each book in the dataset
df_genre[["genre", "image_url"]] = df_genre.apply(lambda row: pd.Series(get_book_info(row["title"], row["author_name"], api_key)), axis=1)

# Display the results
df_genre